In [2]:
import pandas as pd

In [3]:
pwd

'/Users/amodpathirana/ML Tensorflow/Tensorflow-Basics/Pandas'

In [4]:
ls

Pandas Crash Course .ipynb  try1.ipynb
salaries.csv                try2.ipynb
tr3.ipynb

In [6]:
df=pd.read_csv('salaries.csv')
df.head()

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [7]:
df['Name']

0      John
1     Sally
2    Alyssa
Name: Name, dtype: object

In [8]:
df[['Name', 'Age']]

     Name  Age
0    John   34
1   Sally   45
2  Alyssa   27

In [9]:
df['Age'].min()

27

In [10]:
df['Salary'].sum()

250000